---
kind: property
id: P:Autodesk.Revit.DB.FabricationItemFile.IsUsed
source: html/518d8843-10bc-cac9-8bf3-be05d2a4e966.htm
---
# Autodesk.Revit.DB.FabricationItemFile.IsUsed Property

Checks to see if the item file is already in use in the project.

## Syntax (C#)
```csharp
public bool IsUsed { get; }
```